app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
    def index
        apartments = Apartment.all

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        apartment = Apartment.find(params[:id])

INSERT INTO "apartments" ("street_num", "city", "state", "zip", "country", "mgr_name", "mgr_phone", "contact_hours", "created_at", "updated_at", "description", "picture_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
        apartment = Apartment.create(apt_params)