app/controllers/home_controller.rb

    def index
        @apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"